# На запит від програми, користувач вводить 5-ти значне ціле,
# позитивне число. Вам необхідно "перевернути" цє число задом наперед,
# тобто щоб у результаті вийшло теж 5-ти значне число, але із зворотною послідовністю цифр.
#
# Вам не потрібно перевіряти, що користувач ввів правильне число - зробіть вигляд,
# що користувач завжди вводить 5 значне число.
# Тобто введене користувачем число завжди складатиметься з 5 цифр.
# Якщо користувач ввів інше число, це проблема користувача, а не вашої програми.
# Використовуються лише цілі числа.
#
# Приклади:
#
# Користувач ввів: 12345 - на екрані відображається: 54321
#
# Користувач ввів: 37568 - на екран відображається: 86573

number = int(input("введи 5 цифр: "))

digit_1 = number % 10
digit_2 = (number // 10) % 10
digit_3 = (number // 100) % 10
digit_4 = (number // 1000) % 10
digit_5 = (number // 10000) % 10

# Вывод в обратке
reversed_number = digit_1 * 10000 + digit_2 * 1000 + digit_3 * 100 + digit_4 * 10 + digit_5
print(reversed_number)