#Ваша програма повинна вміти розділяти один список на два та помістити їх у новий список.
# Тобто, в результаті повинен вийти список із 2-х списків.

#Якщо в початковому списку непарна кількість елементів, то в першому списку має бути більше елементів.

#Якщо у списку немає елементів, то має бути створений список із двома порожніми списками.

#Важливо! Потрібно створити рішення, яке обробляє 3 випадки - список порожній,
# у списку парна кількість елементів і в списку непарна кількість елементів.

#Приклади:

#Було => стало
def split_list(lst):
    middle = len(lst) // 2
    first_list = lst[:middle]
    second_list = lst[middle:]
    return [first_list, second_list]

examples = [
    [777, 7, 7, 777],
    [7],
    [],
    [777, 7, 7, 7, 7]
]

for lst in examples:
    split_lists = split_list(lst)
    print(split_lists)

